---
kind: property
id: P:Autodesk.Revit.DB.LineProperties.PatternId
source: html/1a6f1360-fc61-d312-43aa-7d95ea5032d1.htm
---
# Autodesk.Revit.DB.LineProperties.PatternId Property

Id of the current Line pattern element used when drawing lines/curves.

## Syntax (C#)
```csharp
public ElementId PatternId { get; }
```